In [2]:
# Import Dependencies
import pandas as pd
import csv
import os

In [3]:
# File to Load
purchase_data_path = "Resources/purchase_data.csv"

# Read modified Purchase Data csv and store into Pandas DataFrame
purchase_df = pd.read_csv(purchase_data_path)
purchase_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [4]:
#Count the total number of players # How to add headings?? 
purchase_df["SN"].unique()
len(purchase_df["SN"].unique())

576

In [5]:
# Number of Unique Items
len(purchase_df["Item Name"].unique())

179

In [6]:
# Average purchase Price
purchase_df['Price'].mean()

3.050987179487176

In [7]:
# TotalNumber of Purchases
len(purchase_df['Purchase ID'])

780

In [8]:
# Total Rev
sum(purchase_df['Price'])

2379.7699999999973

In [9]:
#How to create a summary data frame

In [10]:
# Count of Female,Male and Nonbinary Players

Gender_players_df = purchase_df.groupby(["Gender"]) # How to add sum to the same line?
Gender_players_df.count().drop(columns=['Item Name', 'Price'])

                       Purchase ID   SN  Age  Item ID
Gender
Female                         113  113  113      113
Male                           652  652  652      652
Other / Non-Disclosed           15   15   15       15

In [11]:
# Percent by each gender. How to sum out and figure percentage??
#Gender_players_df(['SN'] / df['SN'].sum() * 100)

In [12]:
#Break out Purchase count, avg purchase price, total purchase value, avg purchasre total/person by gender - Build a dataframe from the groupby? 
Gender_breakout_df = pd.DataFrame([{"Total Purchases": Gender_players_df.sum("Purchase ID"),
                                  "Average Purchase Price": Gender_players_df.mean("Price"),
                                   "Total Purchase Value" : Gender_players_df.sum("Price"),
                                    "Average Purchase Total Per Person by Gender": Gender_players_df.mean("Gender") 
                        }])
Gender_players_df.head()
Gender_player.df.loc[:,[]]

TypeError: f() takes 1 positional argument but 2 were given

In [13]:
#Use grouped data and filer from there Gender > Age
Gender_players_df["Age"].value_counts()

Gender                 Age
Female                 20     14
                       21     13
                       22     13
                       15     10
                       23      9
                              ..
Other / Non-Disclosed  25      2
                       35      2
                       38      2
                       21      1
                       24      1
Name: Age, Length: 69, dtype: int64

In [14]:
Gender_players_df.groups

{'Female': Int64Index([ 15,  18,  38,  41,  55,  66,  71,  72,  76,  81,
             ...
             697, 698, 699, 714, 727, 731, 740, 754, 767, 775],
            dtype='int64', length=113),
 'Male': Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,  10,
             ...
             769, 770, 771, 772, 773, 774, 776, 777, 778, 779],
            dtype='int64', length=652),
 'Other / Non-Disclosed': Int64Index([9, 22, 82, 111, 228, 237, 242, 291, 350, 401, 484, 549, 629, 637,
             747],
            dtype='int64')}

In [15]:
Gender_players_df.get_group('Female') # How to sum from here?

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89
18,18,Reunasu60,22,Female,82,Nirvana,4.90
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33
55,55,Phaelap26,25,Female,84,Arcane Gem,3.79
...,...,...,...,...,...,...,...
731,731,Eudanu84,22,Female,12,Dawne,1.02
740,740,Reunasu60,22,Female,127,"Heartseeker, Reaver of Souls",3.92
754,754,Pheosurllorin41,23,Female,79,"Alpha, Oath of Zeal",4.05
767,767,Ilmol66,8,Female,92,Final Critic,4.88
775,775,Aethedru70,21,Female,60,Wolf,3.54

In [34]:
Gender_players_df.get_group('Male').sum()

Purchase ID                                               255921
SN             Lisim78Lisovynya38Ithergue48Chamassasya86Iskos...
Age                                                        14942
Gender         MaleMaleMaleMaleMaleMaleMaleMaleMaleMaleMaleMa...
Item ID                                                    60698
Item Name      Extraction, Quickblade Of Trembling HandsFrenz...
Price                                                    1967.64
dtype: object

In [16]:

#Pulled out female playser and price 
Gender_players_df.get_group('Female'),["Price"]

(     Purchase ID               SN  Age  Gender  Item ID  \
 15            15        Lisassa64   21  Female       98
 18            18        Reunasu60   22  Female       82
 38            38         Reulae52   10  Female      116
 41            41        Assosia88   20  Female        7
 55            55        Phaelap26   25  Female       84
 ..           ...              ...  ...     ...      ...
 731          731         Eudanu84   22  Female       12
 740          740        Reunasu60   22  Female      127
 754          754  Pheosurllorin41   23  Female       79
 767          767          Ilmol66    8  Female       92
 775          775       Aethedru70   21  Female       60

                         Item Name  Price
 15    Deadline, Voice Of Subtlety   2.89
 18                        Nirvana   4.90
 38        Renewed Skeletal Katana   4.18
 41   Thorn, Satchel of Dark Souls   1.33
 55                     Arcane Gem   3.79
 ..                            ...    ...
 731                         Dawne   1.02
 740  Heartseeker, Reaver of Souls   3.92
 754           Alpha, Oath of Zeal   4.05
 767                  Final Critic   4.88
 775                          Wolf   3.54

 [113 rows x 7 columns],
 ['Price'])

In [17]:
Gender_players_df.mean()

                       Purchase ID        Age    Item ID     Price
Gender
Female                  379.380531  21.345133  85.477876  3.203009
Male                    392.516871  22.917178  93.095092  3.017853
Other / Non-Disclosed   334.600000  24.200000  80.800000  3.346000

In [18]:
#If I pull out the columbns does this answers the questions in that section? Need to pull applicable columns

Gender_players_df.describe()

                      Purchase ID                                        \
                            count        mean         std   min     25%
Gender
Female                      113.0  379.380531  211.605484  15.0  199.00
Male                        652.0  392.516871  227.516414   0.0  193.75
Other / Non-Disclosed        15.0  334.600000  234.524991   9.0  169.50

                                               Age             ... Item ID  \
                         50%     75%    max  count       mean  ...     75%
Gender                                                         ...
Female                 392.0  558.00  775.0  113.0  21.345133  ...   129.0
Male                   390.5  592.25  779.0  652.0  22.917178  ...   139.0
Other / Non-Disclosed  291.0  516.50  747.0   15.0  24.200000  ...   141.0

                              Price                                          \
                         max  count      mean       std   min     25%   50%
Gender
Female                 183.0  113.0  3.203009  1.158194  1.00  2.2800  3.45
Male                   183.0  652.0  3.017853  1.175625  1.00  1.9625  3.09
Other / Non-Disclosed  163.0   15.0  3.346000  0.883813  1.33  3.1000  3.45


                         75%   max
Gender
Female                 4.230  4.90
Male                   4.080  4.99
Other / Non-Disclosed  3.875  4.75

[3 rows x 32 columns]

In [19]:
#Average total putrchase price by gender - check 
filter = purchase_df['Gender'] == "Female"
purchase_df.loc[filter]['Price'].mean()

3.203008849557519

In [35]:
Gender_players_df['Price'].value_counts()

Gender                 Price
Female                 4.40     5
                       1.33     4
                       4.90     4
                       1.02     3
                       2.73     3
                               ..
Other / Non-Disclosed  3.55     1
                       3.58     1
                       3.81     1
                       4.40     1
                       4.75     1
Name: Price, Length: 235, dtype: int64

In [21]:
#Create group by Age 
Age_df = purchase_df.groupby(["Age"])
Age_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
692,692,Quaecjask96,9,Male,78,"Glimmer, Ender of the Moon",4.40
728,728,Chanosiaya39,44,Male,93,Apocalyptic Battlescythe,1.97
738,738,Eusur90,36,Male,121,Massacre,1.60
753,753,Frichirranya75,36,Male,178,"Oathbreaker, Last Hope of the Breaking Storm",4.23
761,761,Assim27,45,Male,17,"Lazarus, Terror of the Earth",1.70

In [36]:
#Break into bins in 4 year increments # How to make over x age? > sign wont work for younger and older - error = ValueError: bins must increase monotonically.

bins = [5.9,9.9,14.9,19.9,24.9,29.9,34.9,39.9,44.9,49.9,54.9, 59.9,150]
group_names = ["6-9","10-14","15-19","20-24","25-29","30-34","35-39","40-44","45-49","50-54","55-60", "Over 60"]

In [37]:

#Group bins with names
#age_groups = pd.cut(Age_df["Age"], bins, labels = group_names)
#New_Age_df = pd.cut(Age_df["Age"], bins, labels=group_names).head()
#Age_df["Age"] = 
pd.cut(Age_df["Age"], bins, labels=group_names, include_lowest=True).head()

ValueError: setting an array element with a sequence.

In [24]:
#Break out top spenders "SN", "Purchase Count" , 'Average Purchase Price', "Total Purchase Value"

#can this approach be taken with multiple values or does each need its own line https://stackoverflow.com/questions/35364601/group-by-and-find-top-n-value-counts-pandas
#Top average purchase
purchase_df.groupby(["SN"]).mean().sort_values("Price", ascending=False).head()

                Purchase ID   Age  Item ID  Price
SN
Dyally87              554.0  22.0     63.0   4.99
Lirtilsa71            246.0  24.0    139.0   4.94
Yarithsurgue62        231.0  26.0    139.0   4.94
Ririp86               110.0  25.0    139.0   4.94
Chanirrasta87         493.0  14.0    139.0   4.94

In [25]:
#Top purchasers by SN
purchase_df.groupby(["SN"]).sum().sort_values("Price", ascending=False).head()

             Purchase ID  Age  Item ID  Price
SN
Lisosia93           1630  125      442  18.96
Idastidru52         1999   96      527  15.45
Chamjask73          1306   66      339  13.83
Iral74              2285   84      518  13.62
Iskadarya95          713   60      321  13.10

In [26]:
#Group By top 5 by Purchase Count Do I need to join the lists base don a key for total purchase count? 
purchase_df.groupby(["SN"]).sum()("Item ID")

TypeError: 'DataFrame' object is not callable

In [27]:
#average pur price top 5 spenders
purchase_df.groupby(["SN"]).mean().sort_values("Price", ascending=False).head()

                Purchase ID   Age  Item ID  Price
SN
Dyally87              554.0  22.0     63.0   4.99
Lirtilsa71            246.0  24.0    139.0   4.94
Yarithsurgue62        231.0  26.0    139.0   4.94
Ririp86               110.0  25.0    139.0   4.94
Chanirrasta87         493.0  14.0    139.0   4.94

In [28]:
#top 5 total purchase value - need to tie the two together again

In [38]:
#Most Popular Items Need to break out by purchase count to sum Item ID, "Item Name", "Purchase Count", "Item Price","Total Purchase Value"
purchase_df.groupby(["Item ID"]).sum().sort_values("Price", ascending=False).head()

         Purchase ID  Age  Price
Item ID
92              6371  266  59.99
178             4960  287  50.76
82              2761  215  44.10
145             4345  187  41.22
103             3947  178  34.80

In [30]:

# Place the data series into a new column inside of the DataFrame
#ted_df["View Group"] = pd.cut(ted_df["views"], bins, labels=group_labels)
#ted_df.head()

SyntaxError: invalid syntax (<ipython-input-30-ad263a95570d>, line 1)